# DuctFittingAndAccessoryPressureDropUIData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIData Class
Members See Also
---
The input and output data used by external UI servers for storing UI settings.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuctFittingAndAccessoryPressureDropUIData : IDisposable
```

Visual Basic
---
```text
Public Class DuctFittingAndAccessoryPressureDropUIData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DuctFittingAndAccessoryPressureDropUIData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI.Mechanical..::..DuctFittingAndAccessoryPressureDropUIData
# See Also
DuctFittingAndAccessoryPressureDropUIData Members
Autodesk.Revit.UI.Mechanical Namespace